{"Id":275,"Name":"Bag of Beans","PageContent":"\n\nSource: Dungeon Master\u0027s Guide\nWondrous item, rare\nInside this heavy cloth bag are 3d4 dry beans. The bag weighs 1/2 pound plus 1/4 pound for each bean it contains.\nIf you dump the bag\u0027s contents out on the ground, they explode in a 10-foot radius, extending from the beans. Each creature in the area, including you, must make a DC 15 Dexterity saving throw, taking 5d4 fire damage on a failed save, or half as much damage on a successful one. The fire ignites flammable objects in the area that aren\u0027t being worn or carried.\nIf you remove a bean from the bag, plant it in the dirt or sand, and then water it, the bean produces an effect 1 minute later from the ground where it was planted. The DM can choose an effect from the following table, determine it randomly, or create an effect.\n\n\nd100\nEffect\n\n\n01\n5d4 toadstools sprout. If a creature eats a toadstool, roll any die. On an odd roll, the eater must succeed on a DC 15 Constitution saving throw or take 5d6 poison damage and become poisoned for 1 hour. On an even roll, the eater gains 5d6 temporary hit points for 1 hour.\n\n\n02-10\nA geyser erupts and sprouts water, beer, berry juice, tea, vinegar, wine, or oil (DM\u0027s choice) 30 feet into the air for 1d12 rounds.\n\n\n11-20\nA treant sprouts (see the Monster Manual for statistics). There\u0027s a 50 percent chance that the treant is chaotic evil and attacks.\n\n\n21-30\nAn animate, immobile stone statue in your likeness rises. It makes verbal threats against you. If you leave it and others come near, it describes you as the most heinous of villains and directs the newcomers to find and attack you. If you are on the same plane of existence as the statue, it knows where you are. The statue becomes inanimate after 24 hours.\n\n\n31-40\nA campfire with blue flames springs forth and burns for 24 hours (or until it is extinguished).\n\n\n41-50\n1d6 \u002B 6 shriekers sprout (see the Monster Manual for statistics).\n\n\n51-60\n1d4 \u002B 8 bright pink toads crawl forth. Whenever a toad is touched, it transforms into a Large or smaller monster of the DM\u0027s choice. The monster remains for 1 minute, then disappears in a puff of bright pink smoke.\n\n\n61-70\nA hungry bulette (see the Monster Manual for statistics) burrows up and attacks.\n\n\n71-80\nA fruit tree grows. It has 1d10 \u002B 20 fruit, 1d8 of which act as randomly determined magic potions, while one acts as an ingested poison of the DM\u0027s choice. The tree vanishes after 1 hour. Picked fruit remains, retaining any magic for 30 days.\n\n\n81-90\nA nest of 1d4 \u002B 3 eggs springs up. Any creature that eats an egg must make a DC 20 Constitution saving throw. On a successful save, a creature permanently increases its lowest ability score by 1, randomly choosing among equally low scores. On a failed save, the creature takes 10d6 force damage from an internal magical explosion.\n\n\n91-99\nA pyramid with a 60-foot-square base bursts upward. Inside is a sarcophagus containing a mummy lord (see the Monster Manual for statistics). The pyramid is treated as the mummy lord\u0027s lair, and its sarcophagus contains treasure of the DM \u0027s choice.\n\n\n00\nA giant beanstalk sprouts, growing to a height of the DM\u0027s choice. The top leads where the DM chooses, such as to a great view, a cloud giant\u0027s castle, or a different plane of existence.\n\n\n\n\n\n\n","Source":"Dungeon Master\u0027s Guide","Type":"wondrous item","Rarity":"rare","RequiresAttunment":false}