{"Id":629,"Name":"Dragon-Touched Focus","PageContent":"\n\nSource: Fizban\u0027s Treasury of Dragons\nWondrous Item, Rarity Varies (Requires Attunement by a Spellcaster)\nThis wondrous item can be a scepter, an orb, an amulet, a crystal, or another finely crafted object. It typically incorporates imagery of dragons’ wings, claws, teeth, or scales.\nSlumbering (Uncommon). You have advantage on initiative rolls. While you are holding the focus, it can function as a spellcasting focus for all your spells.\nStirring (Rare). The Stirring focus has the Slumbering property, and it gains an additional property determined by the family of the dragon in whose hoard it became Stirring:\nChromatic. Whenever you use a spell slot to cast a spell that deals acid, cold, fire, lightning, or poison damage, roll a d6, and you gain a bonus equal to the number rolled to one of the spell’s damage rolls.\nGem. Whenever you use a spell slot to cast a spell, you can immediately teleport to an unoccupied space you can see within 15 feet of you.\nMetallic. When a creature you can see within 30 feet of you makes a saving throw, you can use your reaction to give that creature advantage on the saving throw.\nWakened (Very Rare). The Wakened focus has the Slumbering and Stirring properties, and while you are holding a Wakened focus, you can use it to cast certain spells. Once the item is used to cast a given spell, it can’t be used to cast that spell again until the next dawn. The spells are determined by the family of the dragon in whose hoard it became Wakened.\nChromatic. Hold Monster, Rime’s Binding Ice\nGem. Rary’s Telepathic Bond, Raulothim’s Psychic Lance\nMetallic. Fizban’s Platinum Shield, Legend Lore\nAscendant (Legendary). The Ascendant focus has the Slumbering, Stirring, and Wakened properties. In addition, when you cast a spell of 1st level or higher while holding this focus, you can treat the spell as if it were cast using a 9th-level spell slot. Once this property is used, it can’t be used again until the next dawn.\n\n\n\n\n","Source":"Fizban\u0027s Treasury of Dragons","Type":"wondrous item","Rarity":"rarity varies","RequiresAttunment":false}