{"Id":624,"Name":"Dragon Mask","PageContent":"\n\nSource: Tyranny of Dragons\nWondrous item, legendary (requires attunement)\nEach dragon mask is a legendary wondrous item that reshapes to fit the face and head of a wearer attuned to it. While you are wearing any dragon mask and attuned to it, you gain the following benefits.\nDamage Absorption. You have resistance against the mask\u0027s damage type. If you already have resistance to that damage type from another source, you instead have immunity to that damage type. If you already have immunity to that damage type from another source, whenever you are subjected to damage of that type, you take none of that damage and regain a number of hit points equal to half the damage dealt of that type.\nDraconic Majesty. While you are wearing no armor, you can add your Charisma bonus to your Armor Class.\nDragon Breath. If you have a breath weapon that requires rest to recharge, it gains a recharge of 6.\nDragon Sight. You gain darkvision out to 60 feet, or to an additional 60 feet if you already have that sense. Once per day, you can gain blindsight out to 30 feet for 5 minutes.\nDragon Tongue. You can speak and understand Draconic. You also have advantage on any Charisma check you make against dragons that share the mask\u0027s color.\nLegendary Resistance (1/Day). If you fail a saving throw, you can choose to succeed instead.\nBlack Dragon Mask\nThis horned mask of glossy ebony has a skull-like mien. Its damage type is acid. While you wear the mask, you gain the following benefit, in addition to those the dragon masks share.\nWater Breathing. You can breathe underwater.\nBlue Dragon Mask\nThis mask of glossy azure has spikes around its edges and a ridged horn in its center. Its damage type is lightning. While you wear the mask, you gain the following benefit, in addition to those the dragon masks share.\nLingering Shock. If you deal lightning damage to a creature, it can\u0027t take reactions until its next turn.\nGreen Dragon Mask\nThis mottled green mask is surmounted by a frilled crest and has leathery spiked plates along its jaw. Its damage type is poison. While you wear the mask, you gain the following benefit, in addition to those the dragon masks share.\nWater Breathing. You can breathe underwater.\nRed Dragon Mask\nThis mask of glossy crimson has swept-back horns and spiked cheek ridges. Its damage type is fire. While you wear the mask, you gain the following benefit, in addition to those the dragon masks share.\nDragon Fire. If you deal fire damage to a creature or flammable object, it starts burning. At the start of each of its turns, a creature burning in this way takes 1d6 fire damage. A creature that can reach the burning target can use an action to extinguish the fire.\nWhite Dragon Mask\nThis gleaming mask is white with highlights of pale blue and is topped by a spined crest. Its damage type is cold. While you wear the mask, you gain the following benefit, in addition to those the dragon masks share.\nWinter\u0027s Fury. While your current hit points are equal to or less than half your hit point maximum, you deal an extra 1d8 cold damage with your melee attacks.\n\n\n\n\n","Source":"Tyranny of Dragons","Type":"wondrous item","Rarity":"legendary","RequiresAttunment":true}