{"Id":515,"Name":"Flying Citadel Helm","PageContent":"\n\nSource: Dragonlance: Shadow of the Dragon Queen\nWondrous item, Very Rare (Requires Attunement by a Spellcaster)\nThe function of this ornate chair is to propel and maneuver a flying citadel on which it has been installed. The chair has an AC 15, 18 hit points, and immunity to poison and psychic damage. It is destroyed if reduced to 0 hit points.\nThe sensation of being attuned to a flying citadel helm is akin to the pins-and-needles effect one experiences after one\u0027s arm or leg falls asleep, but not as intense.\nWhile attuned to a flying citadel helm and sitting in it, you gain the following abilities for as long as you maintain concentration (as if concentrating on a spell):\n\nYou can use the flying citadel helm to move the citadel through the air up to 80 feet per round, or up to 8 miles per hour.\n\n\nYou can steer the citadel, albeit in a somewhat clumsy fashion, in much the way a rudder or oars can be used to maneuver a seafaring ship.\n\n\nAt any time, you can see and hear from the highest point outside the citadel as though you were that location.\n\nIf no creature attuned to the helm is maintaining concentration, the citadel remains motionless in its space.\nTransfer Attunement. You can use an action or bonus action to touch a willing spellcaster, whereupon that creature attunes to the flying citadel helm immediately, and your attunement to the flying citadel helm ends.\nCrash. Should the flying citadel helm be destroyed, the citadel it is installed on loses power and begins to crumble. If the crumbling citadel is in the air, it descends at a rate of 30 feet per round, or 300ft per minute. Any creature on the citadel or on the ground within 120 feet of the citadel when it lands must make a DC 20 Dexterity saving throw, taking 39 (6d12) bludgeoning damage on a failed save, or half as much damage on a successful one.\n\n\n\n\n","Source":"Dragonlance","Type":"wondrous item","Rarity":"very rare","RequiresAttunment":false}