{"Id":670,"Name":"Pyxis of Pandemonium","PageContent":"\n\nSource: Mythic Odysseys of Theros\nWondrous item, legendary\nA creature that touches this ornate wooden vessel for 1 minute gains the benefits of a short rest. That creature also gains the effects of the bless spell until the creature finishes a short or long rest. The creature can\u0027t gain these benefits again until it finishes a long rest.\nIf the vessel is opened, roll on the Pyxis of Pandemonium table to determine what happens. Any spells cast by the vessel have a spell save DC of 17. One minute after the vessel is opened, it disappears. It reappears, sealed, in a random location on the same plane of existence 24 hours later.\nCurse. Any creature that gains the benefit of a short rest from the vessel hears cloying telepathic whispers emanating it. That creature must make a DC 17 Wisdom saving throw. On a failed save, the creature is charmed by the vessel for 1 hour. The charmed creature does everything it can to open the vessel as soon as possible. On a successful save, the creature is immune to the vessel\u0027s whispers for 24 hours.\n\n\nPyxis of Pandemonium\n\n\nd8\nCalamity\n\n\n1\nAndrophagia. Each creature within 60 feet of the vessel must succeed on a DC 17 Wisdom saving throw or go berserk for l minute. The berserk creature must begin its turn using the Attack action to make one melee or ranged attack (its choice) against the creature nearest to it. The berserk creature can repeat the save at the end of its turn, ending the effect on itself on a success.\n\n\n2\nBile Blight. The vessel casts the Harm spell on each creature within 30 feet of it.\n\n\n3\nFlood. The vessel casts the Tsunami spell at a point of the DM\u0027s choice within 120 feet of it.\n\n\n4\nMedusa\u0027s Gaze. The vessel casts the Flesh to Stone spell on each creature within 30 feet of it.\n\n\n5\nLabyrinth. The vessel casts the Maze spell on each creature within 30 feet of it.\n\n\n6\nNightmare. Tendrils of shadow seep from the vessel and form into 1d4 shadow demons (see the Monster Manual for their stat block), which appear in unoccupied spaces within 30 feet of it and are hostile.\n\n\n7\nSwarming Insects. The vessel casts the Insect Plague spell, centered on itself and with a radius of 30 feet.\n\n\n8\nUnbridled Revel. The vessel casts the Otto\u0027s Irresistible Dance spell on each creature within 30 feet of it.\n\n\n\n\n\n\n","Source":"Mythic Odysseys of Theros","Type":"wondrous item","Rarity":"legendary","RequiresAttunment":false}