{"Id":747,"Name":"The Infernal Machine Of Lum The Mad","PageContent":"\n\nSource: Infernal Machine Rebuild\nWondrous item, artifact (requires attunement)\nThis strange device was once thought to have been built by gods long forgotten and to have survived the eons since their passing, for it is incredibly ancient and crafted by means unlike anything known today. However, its true origins derive from a planar craft that crashed in the Barrier Peaks, for the Infernal Machine once functioned as this craft’s central command console.\nExplorers who discovered the crash site removed the command console and brought it back to civilization, not understanding its true purpose or powers. In later years, the console came into the possession of Baron Lum. By experimenting with its many controls, he was able to achieve astounding and destructive magical effects in the building of his empire, and so the artifact came to be known as the Infernal Machine of Lum the Mad. Yet with Lum’s eventual defeat, his great machine was destroyed.\nThe Infernal Machine is a delicate, intricate, bulky, and heavy device, weighing some 5,500 pounds. It can be operated using a control panel containing sixty levers, forty dials, twenty switches, and a number of jeweled components. These controls generate all kinds of powers and effects, as noted below.\nSilver Wire. The Infernal Machine’s great size makes it largely immobile. To make ongoing use of the machine (such as while adventuring), it can be connected to its attuned user by a silver wire, a supply of which can always be produced from the machine’s inner workings. This silver wire shares the same general nature as the silvery cord of an Astral Projection spell, connecting to the body of the user and trailing behind them. When so attached, the wire becomes invisible, astral, and extends to virtually infinite length.\nAs long as the wire remains intact, the attuned user can make full use of the Infernal Machine’s powers, with their effects centered around the user. If the wire is cut \u0026#8212; something that can happen only when an effect specifically states that it can cut an Astral Projection\u0027s silvery cord \u0026#8212; the user suffers a sudden burst of feedback from the machine that kills them instantly.\nAny effect of the Infernal Machine that requires concentration can be concentrated on by a remote user. The Infernal Machine’s effects have a spell save DC of 14 or the attuned user’s spell save DC, whichever is higher.\nSummon Monster. When first used by Baron Lum, the Infernal Machine was known for its ability to unleash terrible monsters within the world. Specific combinations of its controls can still recreate the effects of various spells of the conjuration school, as follows:\n\n1/day: Conjure Animals, Summon Lesser Demons\n1/7 days: Conjure Minor Elemental, Conjure Woodland Being, Summon Greater Demon\n1/month: Conjure Elemental, Conjure Fey\n\nWish. The Infernal Machine has the ability to bend the nature of reality, with the proper combination of controls recreating the effect of a Wish spell (including all side effects). Due to the complex nature of its programming, this feature can be used only once per month.\nEach time this effect is used, there is a cumulative 10 percent chance of the Infernal Machine malfunctioning, necessitating seven days’ worth of repairs and reprogramming, as well as the expenditure of 500 gp in parts, before it can be used again. When these repairs are done, the cumulative chance of malfunction returns to 10 percent.\nRandom Properties. There are far more possible combinations for the Infernal Machine’s controls than can ever be known or matrixed \u0026#8212; especially as the controls shift position and reset themselves over time. At the end of each long rest of the user attuned to it, the Infernal Machine generates 1d4 \u002B 1 random beneficial properties and 1d4 \u002B 1 detrimental properties. Roll for each of these properties on the Infernal Machine Properties table. To keep things interesting, the DM might roll secretly for detrimental properties, revealing those properties only during the course of play.\nOnce set, these properties last until the end of the attuned user’s next long rest.\n(Our thanks to the D\u0026amp;D community for their suggestions for the properties of the Infernal Machine of Lum the Mad!)\nDestroying the Machine. The Infernal Machine of Lum the Mad is self-repairing of anything short of catastrophic damage, and how it was disabled in Lum’s time remains a mystery. It is rumored that if one specific combination of controls is set, the Infernal Machine will enter a repair mode, allowing unfettered access to its inner workings \u0026#8212; and preventing it from restoring itself if it is attacked. Alternatively, other combinations of controls might cause the Infernal Machine to teleport its most critical components to some hiding place deep in space and time, rendering it inoperable until those components are found again.\n\n\nInfernal Machine Properties\n\n\nd100\nBeneficial Property\nDetrimental Property\n\n\n01\nYou have a flying speed of 150 feet but lose all other movement.\nYou are blinded.\n\n\n02\nYou can cast the Speak with Animals spell at will, but can use it to speak with only one animal of your choice.\nAll animals despise you. You have disadvantage on Wisdom (Animal Handling) checks.\n\n\n03\nOne weapon or item you carry of your choice gains a walking speed of 30 feet and goes where you tell it.\nYour armor and clothing feels unnaturally tight. Unless you go naked, roll a d4 each time you are attacked and subtract the number rolled from your AC.\n\n\n04\nYou can cast the Legend Lore spell three times.\nWhenever you make an Intelligence check or use divination magic to learn something about a creature, that knowledge comes with added trivia of the DM\u0027s devising.\n\n\n05\nYou emanate a weak magnetic aura. The first time during a combat that a creature attacks you with a metal weapon, that creature has disadvantage on the attack roll.\nMetal rusts in response to your touch \u0026#8212; including metal armor you wear and metal weapons you hold \u0026#8212; reproducing the effect of the rust monster\u0027s Rust Metal trait.\n\n\n06\nYour fingers sprout tiny clockwork picks, granting you advantage on ability checks made using thieves\u0027 tools or tinker\u0027s tools.\nAny metal object you wield or wear is covered in a thin layer of oil that drips occasionally and leaves your fingerprints everywhere.\n\n\n07\nYou can cast the Speak with Animals spell at will, but can use it to communicate only with insects.\nDisturbing whispers on the edge of hearing haunt all creatures within 30 feet of you, causing those creatures to recall their saddest memories.\n\n\n08\nYou have a \u002B1 bonus to Wisdom (Insight checks) involving creatures you can see.\nYour body is ghostly and translucent except for your bones. You have vulnerability to radiant damage, and you have disadvantage on attack rolls while in direct sunlight.\n\n\n09\nYou summon a unicorn that obeys your commands. If you give a command that violates the unicorn\u0027s alignment, the unicorn immediately vanishes.\nYou grow a unicorn horn.\n\n\n10\nA specialized clockwork compass floats in front of you. You can name one character, place, or object on the same plane as you and have the compass point constantly in the direction of the named target. You gain no knowledge of the distance to the target.\nA specialized clockwork compass floats in front of you, and points toward you. The DM determines whether a creatures currently looking for you is drawn to your location. Additionally, when a creature attacks you for the first time during an encounter, it has advantage on the attack roll.\n\n\n11\nYour clothes are wrapped in illusion that makes them appear to be the very latest style, drawing praise and attention. You have a \u002B1 bonus to Charisma checks.\nAny food and drink you eat spoils as you swallow it. Each time you eat or drink, you are poisoned for 1 hour.\n\n\n12\nYou have a \u002B1 bonus to attack rolls with weapons or spells (your choice).\nThe Cure Wounds spell restores no hit points for you.\n\n\n13\nYou have an innate sense of direction. You automatically succeed on ability checks made to avoid becoming lost.\nWhenever you move, a magical voice calls out your direction and how far you’ve gone. The voice cannot be silenced or stopped.\n\n\n14\nYou constantly see afterimages of all events that occurred within 30 feet of you over the previous hour.\nYou are distracted by voices and visions, forcing you to succeed on a Wisdom saving throw every 4 hours or gain one level of exhaustion.\n\n\n15\nYou understand all languages, as if under the effect of a Comprehend Languages spell.\nWhenever you speak, you speak in a random language (possibly including languages you don’t normally know).\n\n\n16\nYou have \u002B1 bonus to initiative rolls.\nYou are unable to hear any speech louder than a whisper.\n\n\n17\nAn exact duplicate of you appears next to you, dressed as you but lacking any gear. The duplicate functions as a familiar and has the statistics of a cat.\nAn exact duplicate of you appears next to you, dressed as you but lacking any gear. It loudly tries to convince all other creatures that it is you, and you are its familiar. If destroyed, it reappears in 1d4 hours.\n\n\n18\nWhile you are afflicted by a disease or suffering the poisoned or frightened condition, whenever you hit a humanoid with a melee attack, the target must succeed on a DC 15 Constitution saving throw. On a failed save, you transfer the disease or the condition to the target, and the disease or condition ends for you.\nWater becomes intensely acidic to you. If you are submerged in water, you take 1d6 acid damage at the start of each of your turns, and drinking pure water causes you to be poisoned for 1 hour.\n\n\n19\nA random Huge beast appears next to you (chosen by the DM) as if with the Conjure Animals spell. You have a telepathic link to this beast, such that you can give it commands even if it can’t hear you.\nA random Huge beast appears next to you (chosen by the DM) and attacks at once.\n\n\n20\nYou have 1 luck point, which you can use as if you had taken the Lucky feat. If you have taken that feat, you have 1 extra luck point.\nThose around you perceive you as dishonest, even when you are completely truthful. You automatically fail Charisma checks.\n\n\n21\nIf you drop to 0 hit points, a phantom guardian appears next to you, functioning as if you had cast the Mordenkainen’s Faithful Hound spell. The guardian disappears if you die, regain hit points, or regain consciousness.\nNo one takes you seriously, imposing disadvantage on Charisma (Deception and Persuasion) checks, and causing you to automatically fail Charisma (Intimidation) checks.\n\n\n22\nYou can cast the Gaseous Form spell on yourself three times. When you do, instead of appearing as mist, you appear as a swirling puff of feathers.\nYour body is covered in feathers.\n\n\n23\nYou have advantage on death saving throws.\nYou have disadvantage on all saving throws except death saving throws.\n\n\n24\nYou can cast Speak with Animals at will, but can use it to communicate only with dogs.\nAll cats are automatically hostile toward you.\n\n\n25\nYou can cast the Raise Dead spell once, requiring no material components.\nIf you drop to 0 hit points, you automatically suffer 1 failed death saving throw.\n\n\n26\nEach time you finish a short rest, up to 100 silver pieces already in your possession become gold pieces, and up to 100 copper pieces become silver pieces.\nAll coins you touch become worthless tin.\n\n\n27\nAnything poisonous within 50 feet of you is automatically detected and marked by the image of a small frog that is visible only to you.\nA dozen small frogs constantly follow you around, chirping loudly.\n\n\n28\nYou gain the benefit of a Nondetection spell.\nYour appearance changes randomly as determined by the DM, as if you were under the effect of a Disguise Self spell.\n\n\n29\nYou can cast the Mage Hand cantrip at will.\nA disembodied spirit follows you around, stealing and scattering coins from you, crumbling your food, and playing with your weapons and gear.\n\n\n30\nYou are able to decipher any text.\nYou lose the ability to speak any language. This has no effect on casting spells with verbal components.\n\n\n31\nYou can cast the Speak with Plants spell three times.\nYour skin turns green, and you must drink a half gallon of fresh water every 4 hours or take 1d4 necrotic damage.\n\n\n32\nYou know whether creatures within 15 feet of you are lying, as if you were the center of a Zone of Truth spell.\nWhenever you would speak falsely, you cannot speak at all.\n\n\n33\nYou gain a sense of destiny that directs you toward an important goal, as determined by the DM.\nYour head is filled with an unpleasant buzzing that imposes disadvantage on Intelligence checks and saving throws.\n\n\n34\nAll creatures you speak with automatically believe your words, as if you have succeeded on a Charisma (Deception or Persuasion) check against them. Any sign of threatening or duplicitous action on your part negates this automatic success.\nYour personal tastes reverse, such that your favorite foods, hobbies, music, and so forth become unbearable to you.\n\n\n35\nYour shadow becomes an undead shadow that shares your alignment and is under your control.\nYour shadow behaves disapprovingly whenever you’re not looking \u0026#8212; stealing things, mocking you behind your back, taunting opponents or friends, and so on.\n\n\n36\nYour skin is covered by slime. You automatically succeed on ability checks and saving throws made to escape a grapple.\nYour skin is covered by slime. You must succeed on a DC 10 Dexterity saving throw to sit down, open doors, and perform other mundane tasks of the DM’s determination.\n\n\n37\nFlowers turn to face you as you pass them.\nMundane animals can’t look at you.\n\n\n38\nEach time you finish a short rest, you suddenly sprout a covering of fragrant leaves. The leaves fall off after 1d10 minutes, revealing 1d6 magic fruits that can be plucked from your head. Each fruit functions as a berry created with the Goodberry spell.\nWhenever you stop moving for 10 minutes or more, you discover that your boots or shoes have set down roots that must be pulled free with a successful DC 20 Strength check.\n\n\n39\nChoose a creature you can see. That creature must succeed on a DC 15 Dexterity saving throw or drop one item they are holding (DM’s choice). You can use this property three times.\nEach time you roll a 1 on a Dexterity check, you drop one object you are holding (DM’s choice).\n\n\n40\nA group of small forest animals appears and follows you everywhere, singing and dancing. These magical creatures can perform any task you desire that could be performed by a Prestidigitation spell.\nYou break out into song whenever you roll a 1 on any die.\n\n\n41\nYour possessions change their state or appearance at the DM’s determination, giving you hints of potential future events. For example, your sword might become suddenly bloodstained to warn of an upcoming combat encounter, your clothes might become damp to warn of a water-filled pit trap ahead, and so on.\nYou take a -5 penalty to initiative rolls.\n\n\n42\nWhenever you roll a 1 on a d20, you have advantage on your next d20 roll.\nWhenever you roll a 1 on a d20, you have disadvantage on your next d20 roll.\n\n\n43\nGrass, moss, and flowers instantly grow in your footsteps. You are also unaffected by difficult terrain created by plants.\nAny harm that befalls a plant you can see (a woodcutter sawing down a tree, a gardener pulling weeds, and so forth) fills you with a sadness that imposes disadvantage on ability checks for 1 minute.\n\n\n44\nYou automatically know the direction to the greatest danger within 500 feet of you.\nYou leave a trail of black footprints that allow anyone to automatically follow you.\n\n\n45\nYou can cast the Detect Thoughts spell three times.\nAll creatures within 30 feet of you automatically know your surface thoughts, as if having cast Detect Thoughts against you.\n\n\n46\nYou can cast the Misty Spell spell three times. When you do, you must begin and end your teleportation in an area of shadow.\nWhile in direct sunlight, you have disadvantage on attack rolls as well as on Wisdom (Perception) checks that rely on sight.\n\n\n47\nCreatures cannot gain advantage on attacks made against you as a result of another creature using the Help action.\nYou have disadvantage on Dexterity (Acrobatics) checks.\n\n\n48\nYou have increased lung capacity, increasing your walking speed by 10 feet and letting you hold your breath for twice as long as normal.\nWhenever you exert yourself by fighting, running, and so forth, you breathe out intermittent gouts of flame that deal 1d4 fire damage to you.\n\n\n49\nYou can cast the Daylight spell three times.\nAn evil undead creature that comes within 30 feet of you for the first time is charmed by you until the end of your next turn.\n\n\n50\nWhen you touch a copper piece, it transmutes to become two copper pieces. You can duplicate a maximum of 1,000 coins this way.\nFood doesn’t satiate you, and you must eat double the amount of food you normally eat to avoid feeling hungry.\n\n\n51\nYou shed light like a torch, as if you were the target of a Light cantrip.\nNo one else can take a short rest within 40 feet of you, as everything you say or do seems distracting to them.\n\n\n52\nYou can cast the Divination spell once.\nWhenever you make an Intelligence check or saving throw, you receive a grim vision of the DM’s determination, imposing disadvantage on your next attack roll, ability check, or saving throw.\n\n\n53\nAs an action, you can become incorporeal for 10 minutes, allowing you to move through other creatures and objects as if they were difficult terrain. You take 5 (1d10) force damage if you end your turn inside an object. You can use this property once.\nYour senses diminish as if the world were faded around you, imposing disadvantage on Wisdom (Perception) checks.\n\n\n54\nWhile you take a short rest, the area within 50 feet of you takes on the illusory appearance of a beautiful forest glade.\nThe first time an ally you can see takes damage as a result of failing a saving throw, you take the damage instead of them.\n\n\n55\nAs a bonus action, you can choose one creature within 10 feet of you and know one secret about it, as determined by the DM.\nThe Remove Curse, Lesser Restoration, and Greater Restoration spells have no effect on you.\n\n\n56\nYou can predict the weather conditions for the next 24 hours with perfect accuracy.\nA rain cloud follows you around, drizzling on you constantly even while indoors.\n\n\n57\nYou have telepathy out to a range of 120 feet.\nYou hear the voices of creatures you can see in your head from time to time (as detailed by the DM), but you have no idea whether what you’re hearing is the truth or not.\n\n\n58\nYou can cast Speak with Animals at will, but you can use it to communicate only with goats. Any goat you speak with becomes charmed by you for 1 hour.\nYou become distraught unless your clothing is all the same color, imposing disadvantage on Intelligence, Wisdom, and Charisma checks and saving throws.\n\n\n59\nYou have resistance to fire damage.\nYou gain no benefit from any potion.\n\n\n60\nYou have immunity to the charmed and frightened conditions.\nYou can speak only in a monotone voice, imposing disadvantage on Charisma checks.\n\n\n61\nYou and each creature within 10 feet of you have resistance to necrotic damage.\nAny Wisdom (Medicine) check you make or that is made to help you is made with disadvantage.\n\n\n62\nThe first creature you hit with a weapon attack on each of your turns takes 1d4 fire damage at the start of its next turn.\nYou are blinded while in bright light, and your shadow takes on a monstrous appearance.\n\n\n63\nNo creature can learn your alignment by magical means, and you have advantage on Charisma checks involving creatures that also share your alignment.\nYou have disadvantage on Charisma checks involving creatures that do not share your alignment.\n\n\n64\nAs a bonus action, you cause yourself and a willing ally you can see to swap positions by teleportation.\nWhenever you roll a 1 on a d20 roll, you and an ally you can see swap positions by teleportation.\n\n\n65\nAs an action, you cause difficult terrain within 50 feet of you to become normal terrain. You can use this property three times.\nEach time you move through difficult terrain, your speed is reduced by 10 feet until the end of your next turn.\n\n\n66\nYou increase one ability score of your choice by 2. You can increase an ability score above 20 using this property, but the increase is lost when this property ends.\nWhenever you roll a 1 on an attack roll, ability check, or saving throw using your highest ability score, you take 1d4 psychic damage.\n\n\n67\nAs an action, you learn the direction and distance to the nearest magic item not in the possession of you or any of your allies.\nEach creature within 30 feet of you automatically knows which magic items you carry\n\n\n68\nAs an action while you are in dim light or darkness, you can become invisible, as if targeted by the Invisibility spell. In addition to becoming visible if you attack or cast a spell, you become visible if you move into bright light. You can use this property three times.\nWhile in bright light, you have disadvantage on initiative rolls.\n\n\n69\nYou can read and understand all the languages commonly spoken within 1 mile of you, as determined by the DM.\nWhile speaking, you occasionally use nonsense words, imposing disadvantage on Charisma checks.\n\n\n70\nYou know one cantrip of the DM’s choice, and can cast one 1st level spell of the DM’s choice at will.\nWhenever you cast a spell or use a magic item property that requires an action or a bonus action to activate, roll on the Wild Magic Surge table (see the sorcerer section in chapter 3 of the Player’s Handbook) to see what happens.\n\n\n71\nWhenever you roll a 20 on a d20, you can immediately end one effect on you.\nWhenever you roll a 1 on a d20, you are blinded until the end of your next turn.\n\n\n72\nAny clothing you wear is covered with a magical map image that shows all the local area you are aware of. This map doesn’t reveal anything you don’t know, but grants advantage on ability checks to find secret doors and to navigate back to where you’ve been.\nAny rope you touch transforms into a poisonous snake that attacks you.\n\n\n73\nYou summon a slithering tracker that obeys your commands.\nYou take on the appearance of having translucent skin, with your bones and organs slightly visible within.\n\n\n74\nYou have a fresh-scrubbed appearance, and a sweet perfume surrounds you. You have advantage on Charisma (Persuasion) checks.\nWhenever you fail a Charisma (Persuasion) check, the subject of the check becomes irrationally resentful of you, seeking to undermine you in ways determined by the DM.\n\n\n75\nYou can cast the Control Weather spell.\nEach time you deal or take cold damage or fire damage, you must succeed on a DC 10 Charisma saving throw or accidentally summon a hostile air elemental or fire elemental (depending on the damage dealt).\n\n\n76\nA tiny construct resembling a gynosphinx follows you around. It can truthfully answer up to ten yes-or-no questions regarding the campaign, at the DM’s discretion.\nA tiny construct resembling a gynosphinx follows you around. It constantly asks unsolvable riddles of other creatures, and insults those creatures when they fail to answer correctly.\n\n\n77\nA creature appears next to you that is a hybrid of any two nonmagical beasts (akin to the owlbear). The creature serves you as if created by a Conjure Animals spell. The DM determines the creature’s statistics.\nA creature appears next to you that is a hybrid of any two nonmagical beasts (akin to the owlbear). Unless you succeed on a DC 12 Wisdom (Animal Handling) check, the creature attacks you before wandering off. The DM determines the creature’s statistics.\n\n\n78\nYou can cast the Teleport spell, always arriving on target when you do. You can use this property once.\nEach time you walk through a doorway or similar portal, you must succeed on a DC 10 Intelligence check or step into a skewed timeline. On a failure, you and all allies within 10 feet of you skip ahead 1d4 minutes. To other creatures, it appears that you and other affected creatures disappear for that length of time, then appear again in the doorway.\n\n\n79\nYou can cast the Haste spell on yourself. You can use this property three times.\nEach time you are reduced to 0 hit points then stabilized, you suffer the effect of a Slow spell.\n\n\n80\nYou do not need to breathe and cease to do so, making you immune to inhaled poisons and suffocation.\nWhenever you speak (including casting a spell with a verbal component), you must first use a bonus action to breathe.\n\n\n81\nYour blood is venomous, granting you immunity to poison and to the poisoned condition. You can cast the Speak with Animals spell at will, but you can use it to communicate only with snakes.\nYour tongue is long and forked, causing you to speak in a hiss. You have disadvantage on Charisma checks involving speech, and you must succeed on a DC 15 Constitution check to cast a spell with a verbal component.\n\n\n82\nYou grow gills and have the ability to breathe air and water. You also sprout a pair of tentacles from your shoulders that have a reach of 10 feet and can be used to perform any action you could perform with your hands. The tentacles cannot attack or grapple.\nYou are constantly followed by 1d4 octopuses that can breathe air and water, and which have a walking speed of 30 feet. Each time combat breaks out, you must succeed on a DC 13 Wisdom (Animal Handling) check or have the octopuses panic and attack you.\n\n\n83\nYou can cast the Misty Step spell three times. When you do, you must begin and end your teleportation in an area of fire. Any fire damage you take during the same turn in which you use Misty Step is restored automatically at the end of your turn.\nWhenever you start your turn within 30 feet of an ongoing fire effect, you must succeed on a DC 13 Wisdom saving throw or move toward the fire and into it if possible.\n\n\n84\nWhen you look at the sky, you see it overlaid with navigational symbols. You have advantage on ability checks made to avoid becoming lost while outdoors.\nYou have disadvantage on Wisdom (Perception) checks while indoors.\n\n\n85\nYou can cast the Healing Word spell three times.\nUndead are drawn to you, making it impossible for you to hide from them. Each undead creature you face in combat has advantage on its first attack roll against you.\n\n\n86\nAny food you touch is transformed into a culinary delight. You have advantage on Charisma checks while interacting with any creatures that have eaten of this food.\nYou constantly hear distracting music that throws off your timing, imposing disadvantage on initiative rolls and Dexterity checks.\n\n\n87\nYour mind is filled with lost facts and lore, granting advantage on Intelligence checks.\nYou forget your name, and must be constantly reminded of it by your allies.\n\n\n88\nYour touch can change small nonmagical objects into chocolate.\nAnything you eat or drink makes you feel overly sated and full, imposing disadvantage on Strength checks for 1 hour.\n\n\n89\nEach time you finish a short rest, you regain 1d8 hit points. Each creature that took a short rest with you and remained within 30 feet of you for the duration also gains this benefit.\nEach time you finish a short rest, you take 3d8 psychic damage. At your determination, you can transfer some or all of this damage to any creatures that took a short rest with you and remained within 30 feet of you for the duration.\n\n\n90\nEach time you finish a short rest, you find 1d10 small gems worth 10 gp each in your possession.\nWhenever you spend coins or gems, any character you give them to becomes convinced that the wealth was stolen from them.\n\n\n91\nWhen you hit a creature for the first time during an encounter, its Armor Class is reduced by 1.\nWhenever you roll a 1 on a weapon attack roll, the weapon shatters like glass. The weapon magically reforms in 1d4 rounds.\n\n\n92\nEach time you enter a settlement, you are treated as though you are known there and a friend, even if you are neither.\nEach time you roll a 1 on an attack roll, ability check, or saving throw, you grow one inch taller. Your clothing and armor does not grow with you.\n\n\n93\nWhile standing in a doorway, you can cast the Teleport spell. Your destination must be another doorway you know. You can use this property once.\nEach time you finish a short rest, you forget one of your allies (of the DM’s choice) and no longer trust that character. You lose this distrust at the end of your next short rest.\n\n\n94\nAs an action, you cause a swirling storm of rocks and dust to surround you in a 10-foot radius for 1 minute. Each creature hostile to you that enters the area must succeed on a DC 12 Constitution saving throw or take 1d6 bludgeoning damage and be blinded for 1 round. You can use this property three times.\nFire elementals, water elementals, and other creatures of fire and water (as determined by the DM) regard you as their enemy, and focus their attacks against you to the exclusion of all else.\n\n\n95\nAs an action, you learn the names of every humanoid creature within 30 feet of you.\nWhenever you roll a 1 on a Strength or Dexterity check that incorporates touching an object, you stick to that object for 1 minute. It takes a successful DC 20 Strength check to free yourself.\n\n\n96\nYou can cast the Modify Memory spell once.\nWhenever you make an Intelligence check or saving throw, you must succeed on a DC 13 Charisma saving throw or lose all your memories of the past hour.\n\n\n97\nYou can ignore the verbal component of any spell you cast.\nYou must shout the verbal component of any spell you cast.\n\n\n98\nAs an action, you conjure a mindless, shapeless force that is your exact duplicate. You control this force as if it were the product of an Unseen Servant spell, except that it is visible.\nEach time you see your own reflection, you must succeed on a DC 12 Charisma saving throw. On a failure, you treat your allies as enemies and vice versa for 1 minute, attacking the wrong targets, betraying your companions in social situations, and so forth. You can repeat the saving throw at the end of each of your turns, ending the effect on a success.\n\n\n99\nAs an action, you can replace one of your hands with any nonmagical weapon, tool, or piece of adventuring equipment of reasonable size (as determined by the DM).\nYour hands feel unnaturally large, imposing disadvantage on Dexterity (Sleight of Hand) checks and Dexterity checks using thieves’ tools or artisan’s tools. The first weapon attack roll you make in any encounter is made with disadvantage.\n\n\n00\nAll creatures of a particular type other than humanoid (as chosen by the DM) are incapable of acting hostile toward you as long as you do not attack, threaten, or provoke them.\nWhenever you meet a creature of a particular type other than humanoid (as chosen by the DM), there is a 1 percent cumulative chance that the tarrasque is magically summoned within 1 mile of you. The tarrasque has no knowledge of your existence. It runs amok for 1d6 × 10 minutes, then magically returns to its previous location.\n\n\n\n\n\n\n","Source":"Infernal Machine Rebuild","Type":"wondrous item","Rarity":"artifact","RequiresAttunment":true}