{"Id":705,"Name":"Verminshroud","PageContent":"\n\nSource: Explorer\u0027s Guide to Wildemount\nWondrous item, legendary (requires attunement)\nThis patchy cloak was pieced together from the pelts of rats found feasting on the dead in Blightshore and is dotted with the bloated corpses of magically preserved insects along its seams.\nDormant. While wearing the Verminshroud in its dormant state, you gain the following benefits:\n\nYou have advantage on Wisdom (Perception) checks that rely on smell, you are immune to disease, and you have darkvision out to a range of 60 feet. If you already have darkvision, wearing the cloak increases the range of your darkvision by 60 feet.\nAs an action, you can use the verminshroud to cast Polymorph on yourself, transforming into a giant rat or rat while retaining your Intelligence, Wisdom, and Charisma scores, as well as the properties of the cloak. This property can\u0027t be used again until the next dawn.\n\nAwakened. While wearing the Verminshroud in its awakened state, you gain the following benefits:\n\nYou have resistance to poison damage.\nYou can use an action to cast the Insect Plague spell (save DC 15) from the Verminshroud, requiring no material components. This property can\u0027t be used again until the next dawn.\nWhen you cast the Polymorph spell using the Verminshroud, you can transform into a giant wasp.\n\nExalted. While wearing the Verminshroud in its exalted state, you gain the following benefits:\n\nYou gain a climbing speed equal to your walking speed.\nYour teeth become razor-sharp natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal piercing damage equal to 1d6 \u002B your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. You can make this attack as a bonus action. When you bite a creature and deal damage to it, the creature must succeed on a DC 17 Constitution saving throw or be poisoned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the condition on itself on a success.\nWhen you cast the Polymorph spell using the Verminshroud, you can transform into a giant scorpion.\n\n\n\n\n\n","Source":"Explorer\u0027s Guide to Wildemount","Type":"wondrous item","Rarity":"legendary","RequiresAttunment":true}