{"Id":748,"Name":"Wand of Orcus","PageContent":"\n\nSource: Dungeon Master\u0027s Guide\nWand, artifact (requires attunement)\nThe ghastly Wand of Orcus rarely leaves Orcus\u0027s side. The device, as evil as its creator, shares the demon lord\u0027s aims to snuff out the lives of all living things and bind the Material Plane in the stasis of undeath. Orcus allows the wand to slip from his grasp from time to time. When it does, it magically appears wherever its master senses an opportunity to achieve some fell goal.\nMade from bones as hard as iron, the wand is topped with a magically enlarged skull that once belonged to a human hero slain by Orcus. The wand can magically change in size to better conform to the grip of its user. Plants wither, drinks spoil, flesh rots, and vermin thrive in the wand\u0027s presence.\nAny creature besides Orcus that tries to attune to the wand must make a DC 17 Constitution saving throw. On a successful save, the creature takes 10d6 necrotic damage. On a failed save, the creature dies and rises as a zombie.\nIn the hands of one who is attuned to it, the wand can be wielded as a magic mace that grants a \u002B 3 bonus to attack and damage rolls made with it. The wand deals an extra 2d12 necrotic damage on a hit.\nRandom Properties. The Wand of Orcus has the following random properties:\n\n2 minor beneficial properties\n1 major beneficial property\n2 minor detrimental properties\n1 major detrimental property\n\nThe detrimental properties of the Wand of Orcus are suppressed while the wand is attuned to Orcus himself.\nProtection. You gain a \u002B3 bonus to Armor Class while holding the wand.\nSpells. The wand has 7 charges. While holding it, you can use an action and expend 1 or more of its charges to cast one of the following spells (save DC 18) from it: Animate Dead (1 charge), Blight (2 charges), Circle of Death (3 charges), Finger of Death (3 charges), Power Word Kill (4 charges), or Speak with Dead (1 charge). The wand regains 1d4 \u002B 3 expended charges daily at dawn.\nWhile attuned to the wand, Orcus or a follower blessed by him can cast each of the wand\u0027s spells using 2 fewer charges (minimum of 0).\nCall Undead. While you are holding the wand, you can use an action to conjure skeletons and zombies, calling forth as many of them as you can divide 500 hit points among, each undead having average hit points (see the Monster Manual for statistics). The undead magically rise up from the ground or otherwise form in unoccupied spaces within 300 feet of you and obey your commands until they are destroyed or until dawn of the next day, when they collapse into inanimate piles of bones and rotting corpses. Once you use this property of the wand, you can\u0027t use it again until the next dawn.\nWhile attuned to the wand, Orcus can summon any kind of undead, not just skeletons and zombies. The undead don\u0027t perish or disappear at dawn the following day, remaining until Orcus dismisses them.\nSentience. The Wand of Orcus is a sentient, chaotic evil item with an Intelligence of 16, a Wisdom of 12, and a Charisma of 16. It has hearing and darkvision out to a range of 120 feet.\nThe wand communicates telepathically with its wielder and can speak, read, and understand Abyssal and Common.\nPersonality. The wand\u0027s purpose is to help satisfy Orcus\u0027s desire to slay everything in the multiverse. The wand is cold, cruel, nihilistic, and bereft of humor.\nIn order to further its master\u0027s goals, the wand feigns devotion to its current user and makes grandiose promises that it has no intention of fulfilling, such as vowing to help its user overthrow Orcus.\nDestroying the Wand. Destroying the Wand of Orcus requires that it be taken to the Positive Energy Plane by the ancient hero whose skull surmounts it. For this to happen, the long-lost hero must first be restored to life - no easy task, given the fact that Orcus has imprisoned the hero\u0027s soul and keeps it hidden and well guarded.\nBathing the wand in positive energy causes it to crack and explode, but unless the above conditions are met, the wand instantly reforms on Orcus\u0027s layer of the Abyss.\n\n\n\n\n","Source":"Dungeon Master\u0027s Guide","Type":"wand","Rarity":"artifact","RequiresAttunment":true}