{"Id":707,"Name":"Wave","PageContent":"\n\nSource: Dungeon Master\u0027s Guide\nWeapon (trident), legendary (requires attunement by a creature that worships a god of the sea)\nHeld in the dungeon of White Plume Mountain, this trident is an exquisite weapon engraved with images of waves, shells, and sea creatures. Although you must worship a god of the sea to attune to this weapon, Wave happily accepts new converts.\nYou gain a \u002B3 bonus to attack and damage rolls made with this magic weapon. If you score a critical hit with it, the target takes extra necrotic damage equal to half its hit point maximum.\nThe weapon also functions as a Trident of Fish Command and a Weapon of Warning. It can confer the benefit of a Cap of Water Breathing while you hold it, and you can use it as a Cube of Force by choosing the effect, instead of pressing cube sides to select it.\nSentience. Wave is a sentient weapon of neutral alignment, with an Intelligence of 14, a Wisdom of 10, and a Charisma of 18. It has hearing and darkvision out to a range of 120 feet.\nThe weapon communicates telepathically with its wielder and can speak, read, and understand Aquan. It can also speak with aquatic animals as if using a speak with animals spell, using telepathy to involve its wielder in the conversation.\nPersonality. When it grows restless, Wave has a habit of humming tunes that vary from sea chanteys to sacred hymns of the sea gods.\nWave zealously desires to convert mortals to the worship of one or more sea gods, or else to consign the faithless to death. Conflict arises if the wielder fails to further the weapon\u0027s objectives in the world.\nThe trident has a nostalgic attachment to the place where it was forged, a desolate island called Thunderforge. A sea god imprisoned a family of storm giants there, and the giants forged Wave in an act of devotion to \u0026#8212; or rebellion against \u0026#8212; that god.\nWave harbors a secret doubt about its own nature and purpose. For all its devotion to the sea gods, Wave fears that it was intended to bring about a particular sea god\u0027s demise. This destiny is something Wave might not be able to avert.\n\n\n\n\n","Source":"Dungeon Master\u0027s Guide","Type":"weapon","Rarity":"legendary","RequiresAttunment":true}