{"Id":651,"Name":"Jewel of Three Prayers","PageContent":"\n\nSource: Critical Role - Call of the Netherdeep\nWondrous item, legendary (requires attunement)\nThe Jewel of Three Prayers is a Vestige of Divergence. In ancient times, Alyxian the Apotheon bore this amulet as a symbol of his covenant with three Prime Deities: Sehanine the Moon Weaver, Avandra the Change Bringer, and Corellon the Arch Heart. When the jewel is found, only Sehanine’s power thrums within its dormant heart. The power of the other two deities waits to be reawakened by a hero - or heroes - who can follow in Alyxian’s footsteps.\nDormant State. In this state, the Jewel of Three Prayers is a glittering golden disk attached to a fine golden chain. The chain magically resizes to function as a necklace for the creature that wears it.\n\nIn its Dormant State, the jewel has the following properties:\n\nYou gain a \u002B1 bonus to AC while wearing the jewel.\nWhile wearing or holding the jewel, you can use an action to cause it to shed bright light in a 15-foot radius and dim light for an additional 15 feet. The light lasts until you extinguish it (no action required).\nThe jewel has 3 charges and regains all its expended charges daily at dawn. While holding the jewel, you can expend 1 charge from it to cast the Invisibility spell.\n\n\n\nAwakened State. In this state, the jewel has received the blessing of Avandra the Change Bringer. Three delicate spires unfurl from the jewel’s center, like the buds of flowers opening in the spring. Three lapis lazuli stones rest like dewdrops on these spires.\n\nThe following benefits of the jewel improve:\n\nThe bonus that the jewel confers to your AC increases to \u002B2.\nIts number of charges increases to 5.\n\n\nThe jewel gains the following additional properties, which you can use while wearing or holding it:\n\nYou can expend 1 of the jewel’s charges (no action required) to end one of the following conditions on yourself: grappled, paralyzed, or restrained.\nWhen another creature you can see within 60 feet of you fails a saving throw, you can expend 1 of the jewel’s charges as a reaction to enable that creature to reroll the saving throw, potentially turning a failure into a success. The creature must use the new roll.\n\n\n\nExalted State. In this state, the jewel has received the blessing of Corellon the Arch Heart. A gleaming emerald surrounded by a halo of gold appears on the jewel.\n\nThe following benefits of the jewel improve:\n\nThe bonus that the jewel confers to your AC increases to \u002B3.\nIts number of charges increases to 7.\n\n\nThe jewel gains the following additional properties, which you can use while wearing or holding it:\n\nYou gain the ability to breathe water, and you gain a swimming speed equal to your walking speed.\nEach of your allies within 30 feet of you gains the ability to breathe water and gains a swimming speed equal to its walking speed.\nAs a bonus action, you can expend 1 of the jewel’s charges to target yourself or one willing creature you can see within 15 feet of yourself. The target teleports to an unoccupied space of your choice within 15 feet of yourself, along with any equipment the target is wearing or carrying. The target appears in a flash of golden radiance, and each creature of your choice within 5 feet of the target’s new location must make a DC 18 Constitution saving throw. On a failed save, the creature takes a 4d10 radiant damage and is blinded until the start of your next turn. On a successful save, the creature takes half as much damage and isn’t blinded.\n\n\n\n\n\n\n\n","Source":"Critical Role - Call of the Netherdeep","Type":"wondrous item","Rarity":"legendary","RequiresAttunment":true}