{"Id":719,"Name":"Blade of Broken Mirrors","PageContent":"\n\nSource: Explorer\u0027s Guide to Wildemount\nWeapon (dagger), artifact (requires attunement by a humanoid)\nA weapon of Tharizdun, this dagger is a piece of jagged stone whose blade is scribed with a maze-like pattern with no beginning or end.\nSentience. The Blade of Broken Mirrors is a sentient chaotic evil weapon with an Intelligence of 21, a Wisdom of 24, and a Charisma of 24. It has hearing and darkvision out to a range of 120 feet.\nThe weapon communicates telepathically with its wielder and can speak, read, and understand Abyssal and Common.\nPersonality. An insane glabrezu named Ragazuu lives within the Blade of Broken Mirrors. The weapon yearns to cause chaos. It learns its wielder\u0027s principles, then uses those ideals to encourage reckless action. The dagger whispers ideas of revolution.\nDormant. The dagger grants the following benefits in its dormant state:\n\nYou can speak, read, and write Abyssal.\nYou gain a \u002B1 bonus to attack and damage rolls made with this magic weapon. Immediately after you make a ranged attack with this weapon, it returns to your hand.\nWhenever you kill a humanoid with an attack using the Blade of Broken Mirrors, the blade remembers the creature\u0027s appearance. While holding the dagger, you can use an action to change your form to match any humanoid the blade remembers. Your statistics, other than your size, don\u0027t change. Any equipment you are wearing or carrying isn\u0027t transformed. You can revert to your true appearance as an action. You revert to your true appearance automatically when you die.\n\nWhen the Blade of Broken Mirrors attunes to a new wielder, the appearances of humanoids it has killed are wiped from its memory.\n\n\n\nAwakened. When the dagger reaches an awakened state, it gains the following properties:\n\nThe weapon\u0027s bonus to attack and damage rolls increases to \u002B2.\nWhile holding the weapon, you can use an action to cast one of the following spells from it (save DC 15): Fabricate, Hallucinatory Terrain, Major Image, or Phantasmal Killer. Once a spell has been cast using the dagger, that spell can\u0027t be cast from the dagger again until the next dawn.\n\nExalted. When the dagger reaches an exalted state, it gains the following properties:\n\nThe weapon\u0027s bonus to attack and damage rolls increases to \u002B3.\nThe saving throw DC for spells cast from the dagger increases to 17.\nWhile holding the dagger, you can turn invisible as an action. Anything you are wearing or carrying is invisible with you. You remain invisible until you stop holding the dagger, until you attack or cast a spell that forces a creature to make a saving throw, or until you use a bonus action to become visible again.\n\n\n\n\n\n","Source":"Explorer\u0027s Guide to Wildemount","Type":"weapon","Rarity":"artifact","RequiresAttunment":true}