{"Id":646,"Name":"Infiltrator\u0027s Key","PageContent":"\n\nSource: Explorer\u0027s Guide to Wildemount\nWondrous item, legendary (requires attunement)\nThis mithral skeleton key was forged using the blood of twelve master thieves executed for trying to steal magic items during the Age of Arcanum.\nDormant. The Infiltrator\u0027s Key grants the following benefits in its dormant state:\n\nThe key can be used as thieves\u0027 tools for the purpose of opening locks. When using the key, you are considered proficient in thieves\u0027 tools and you have advantage on ability checks made to open locks.\nWhile holding the key, your steps are muffled, giving you advantage on Dexterity (Stealth) checks made to move silently.\n\nAwakened. When the Infiltrator\u0027s Key reaches an awakened state, it gains the following properties:\n\nWhile holding the key, you can use a bonus action to transform the key into a magic dagger or back into a key. While the key is in the form of a dagger, you gain a \u002B1 bonus to attack and damage rolls made with it, and it returns to your hand immediately after it is used to make a ranged attack.\nWhile holding the key, you can use an action to cast one of the following spells from it: Alter Self, Invisibility, Knock, or Pass Without Trace. Once a spell has been cast using the key, it can\u0027t be used to cast that spell again until the next dawn.\n\nExalted. When the Infiltrator\u0027s Key reaches an exalted state, it gains the following properties:\n\nAs a bonus action, you can touch the key to a floor, wall, or ceiling that is no more than 5 feet thick and cause a magical opening to appear in the surface. When you create the opening, you choose its length and width, up to 10 feet for each dimension. The opening lasts until the key passes through it to the other side, at which point it disappears (if a creature is in the opening when the doorway closes, the creature is safely shunted to the nearest unoccupied space). The key can\u0027t be used to create another opening until the next dawn.\nWhile holding the key, you can use an action to cast one of the following spells from it: Dimension Door, Gaseous Form, or Mislead. Once a spell has been cast using the key, it can\u0027t be used to cast that spell again until the next dawn.\n\n\n\n\n\n","Source":"Explorer\u0027s Guide to Wildemount","Type":"wondrous item","Rarity":"legendary","RequiresAttunment":true}