{"Id":731,"Name":"Luba\u0027s Tarokka of Souls","PageContent":"\n\nSource: Tasha\u0027s Cauldron of Everything\nWondrous item, artifact (requires attunement)\nNot all lingering spirits are tragic souls, lost on their way to the hereafter. Some languish as prisoners, souls so wicked mortals dare not free them upon an unsuspecting afterlife.\nCreated by a figure of Vistani legend, Luba\u0027s Tarokka of Souls shaped the destiny of countless heroes. The prophecies of this deck of cards also revealed great evils and guided its creator into the path of nefarious forces. Untold times the deck\u0027s creator, Mother Luba, narrowly escaped doom, spared only by her keen insights. But even for her not all wickedness could be escaped. In the most dire cases, Mother Luba managed to ensnare beings of pure evil amid the strands of fate, imprisoning them within her tarroka deck. There these foul spirits dwell still, trapped within a nether-realm hidden amid shuffling cards, waiting for fate to turn foul \u0026#8212; as it inevitably will.\nLike all tarokka decks, the Tarokka of Souls is a lavishly illustrated collection of fifty-four cards, comprising the fourteen cards of the high deck and forty other cards divided into four suits: coins, glyphs, stars, and swords.\nRandom Properties. The artifact has the following random properties, which you can determine by rolling on the tables in the \u0026quot;Artifacts\u0026quot; section of the Dungeon Master\u0027s Guide:\n\n2 minor detrimental properties\n2 minor beneficial properties\n\nSpells. While holding the deck, you can use an action to cast one of the following spells (save DC 18) from it: Comprehend Languages, Detect Evil and Good, Detect Magic, Detect Poison and Disease, Locate Object, or Scrying. Once you use the deck to cast a spell, you can\u0027t cast that spell again from it until the next dawn.\nEnduring Vision. While holding the deck, you automatically succeed on Constitution saving throws made to maintain your concentration on divination spells.\nTwist of Fate. As an action, you can draw a card from the deck and twist the fortune of another creature you can see within 15 feet of you. Choose one of the following effects:\n\nWeal. The creature has advantage on attack rolls, ability checks, and saving throws for the next hour.\nWoe. The creature has disadvantage on attack rolls, ability checks, and saving throws for the next hour.\n\nThe deck can be used in this way twice, and you regain all expended uses at the next dawn.\nPrisoners of Fate. Whenever you use the Twist of Fate property, there is a chance that one of the souls trapped in the deck escapes. Roll d100 and consult the Souls of the Tarokka table. If you roll one of the high cards, the soul associated with it escapes. You can find its statistics in the Monster Manual. If you roll a soul that has already escaped, roll again.\n\n\nSouls of the Tarokka\n\n\nd100\nCard\nSoul\n\n\n1\nArtifact\nFlameskull\n\n\n2\nBeast\nWraith\n\n\n3\nBroken One\nBanshee\n\n\n4\nDarklord\nVampire\n\n\n5\nDonjon\nMummy\n\n\n6\nExecutioner\nDeath knight\n\n\n7\nGhost\nGhost\n\n\n8\nHorseman\nMummy lord\n\n\n9\nInnocent\nGhost\n\n\n10\nMarionette\nMummy\n\n\n11\nMists\nWraith\n\n\n12\nRaven\nVampire spawn\n\n\n13\nSeer\nVampire\n\n\n14\nTempter\nVampire spawn\n\n\n15-00\n\u0026#8212;\n\u0026#8212;\n\n\nThe released soul appears at a random location within 10d10 miles of you and terrorizes the living. Until the released soul is destroyed, it gains the benefit of a weal from the deck\u0027s Twist of Fate property, and both you and the original target of Twist of Fate suffer the effect of woe.\nShuffling Fate. If you go 7 days without using the Twist of Fate property, your attunement to Luba\u0027s Tarroka of Souls ends, and you can\u0027t attune to it again until after another creature uses Twist of Fate on you.\nDestroying the Deck. Luba\u0027s Tarokka of Souls can be destroyed only if all fourteen souls within are released and destroyed. This reveals a fifteenth soul, a lich, that inhabits the Nether card, which appears only when the fourteen souls are defeated. If this ancient entity is destroyed, the Nether card vanishes and the deck becomes a normal tarokka deck, with no special properties, but it includes a new card of the DM\u0027s design.\n\n\n\n\n","Source":"Tasha\u0027s Cauldron of Everything","Type":"wondrous item","Rarity":"artifact","RequiresAttunment":true}