{"Id":732,"Name":"Mace of the Black Crown","PageContent":"\n\nSource: Explorer\u0027s Guide to Wildemount\nWeapon (mace), artifact (requires attunement)\nThis mace has a haft of black iron and a ruby head with a fiendish countenance. Carrying the boon of Asmodeus, it is fit for the most powerful servants of the Nine Hells.\nSentience. The Mace of the Black Crown is a sentient lawful evil weapon with an Intelligence of 20, a Wisdom of 12, and a Charisma of 18. It has hearing and darkvision out to a range of 120 feet.\nThe weapon communicates telepathically with its wielder and can speak, read, and understand Common and Infernal.\nPersonality. A greedy erinyes named Xartaza lives within the Mace of the Black Crown. Xartaza wants to recruit more souls for Asmodeus, so the weapon pushes its wielder toward lawful evil actions by manipulating the wielder\u0027s dreams. A former Blood War general, Xartaza hates demons and relishes crafting sound battle plans in any conflict.\nDormant. The mace grants the following benefits in its dormant state:\n\nYou can speak, read, and write Infernal.\nYou gain a \u002B1 bonus to attack and damage rolls made with this magic weapon.\nWhile holding the mace, you can use a bonus action to speak its Infernal command word, causing flames to erupt from the head. These flames shed bright light in a 40-foot radius and dim light for an additional 40 feet. While the mace is ablaze, it deals an extra 1d6 fire damage to any target it hits. The flames last until you use a bonus action to speak the command word again or until you are no longer holding the mace.\nWhile holding the mace, you can use an action to summon an imp. Any devil you summon with this mace is friendly to you and your companions for the duration. The imp obeys any verbal commands that you issue to it and returns to the Nine Hells 10 minutes after you summoned it. This property can\u0027t be used again until the next dawn.\n\nAwakened. When the mace reaches an awakened state, it gains the following properties:\n\nThe weapon\u0027s bonus to attack and damage rolls increases to \u002B2, and the extra fire damage dealt by the weapon when it is ignited increases to 2d6.\nThe weapon\u0027s Summon Devil feature can also be used to summon a bearded devil.\nYou have resistance to poison damage while holding this weapon.\n\nExalted. When the mace reaches an exalted state, it gains the following properties:\n\nThe weapon\u0027s bonus to attack and damage rolls increases to \u002B3, and the extra fire damage dealt by the weapon when it is ignited increases to 3d6. Fire damage dealt by the mace ignores resistance to fire damage.\nThe weapon\u0027s Summon Devil feature can also be used to summon a barbed devil.\nYou have resistance to fire damage while you hold this weapon.\n\n\n\n\n\n","Source":"Explorer\u0027s Guide to Wildemount","Type":"weapon","Rarity":"artifact","RequiresAttunment":true}