{"Id":176,"Name":"Mizzium Apparatus","PageContent":"\n\nSource: Guildmaster\u0027s Guide to Ravnica\nWondrous item, uncommon (requires attunement by a sorcerer, warlock, or wizard)\nInnovation is a dangerous pursuit, at least the way the mages of the Izzet League engage in it. As protection against the risk of an experiment going awry, they have developed a device to help channel and control their magic. This apparatus is a collection of leather straps, flexible tubing, glass cylinders, and plates, bracers, and fittings made from a magic-infused metal alloy called mizzium, all assembled into a harness. The item weighs 8 pounds.\nWhile you are wearing the mizzium apparatus, you can use it as an arcane focus. In addition, you can attempt to cast a spell that you do not know or have prepared. The spell you choose must be on your class\u0027s spell list and of a level for which you have a spell slot, and you must provide the spell\u0027s components.\nYou expend a spell slot to cast the spell as normal, but before resolving it you must make an Intelligence (Arcana) check. The DC is 10 \u002B twice the level of the spell slot you expend to cast the spell.\nOn a successful check, you cast the spell as normal, using your spell save DC and spellcasting ability modifier. On a failed check, you cast a different spell from the one you intended. Randomly determine the spell you cast by rolling on the table for the level of the spell slot you expended. If the slot is 6th level or higher, roll on the table for 5th-level spells.\nIf you try to cast a cantrip you don\u0027t know, the DC for the Intelligence (Arcana) check is 10, and on a failed check, there is no effect.\n\n\n1st-Level Spells\n\n\nd6\nSpell\n\n\n1\nBurning Hands\n\n\n2\nChaos Bolt\n\n\n3\nColor Spray\n\n\n4\nFaerie Fire\n\n\n5\nFog Cloud\n\n\n6\nThunderwave\n\n\n\n\n2nd-Level Spells\n\n\nd6\nSpell\n\n\n1\nBlur\n\n\n2\nGust of Wind\n\n\n3\nHeat Metal\n\n\n4\nMelf\u0027s Acid Arrow\n\n\n5\nScorching Ray\n\n\n6\nShatter\n\n\n\n\n3rd-Level Spells\n\n\nd6\nSpell\n\n\n1\nFear\n\n\n\n2\nFeign Death\n\n\n3\nFireball\n\n\n4\nGaseous Form\n\n\n5\nSleet Storm\n\n\n6\nStinking Cloud\n\n\n\n\n4th-Level Spells\n\n\nd4\nSpell\n\n\n1\nConfusion\n\n\n2\nConjure Minor Elementals\n\n\n3\nEvard\u0027s Black Tentacles\n\n\n4\nIce Storm\n\n\n\n\n5th-Level Spells\n\n\nd4\nSpell\n\n\n1\nAnimate Objects\n\n\n2\nCloudkill\n\n\n3\nCone of Cold\n\n\n4\nFlame Strike\n\n\n\n\n\n\n","Source":"Guildmaster\u0027s Guide to Ravnica","Type":"wondrous item","Rarity":"uncommon","RequiresAttunment":true}