{"Id":663,"Name":"Orcsplitter","PageContent":"\n\nSource: Princes of the Apocalypse\nWeapon (greataxe), legendary (requires attunement by a good-aligned dwarf, fighter, or paladin)\nA mighty axe wielded long ago by the dwarf king Torhild Flametongue, Orcsplitter is a battered weapon that appears unremarkable at first glance. Its head is graven with the Dwarvish runes for “orc,” but the runes are depicted with a gap or slash through the markings; the word “orc” is literally split in two.\nYou gain the following benefits while holding this magic weapon:\n\nYou gain a \u002B2 bonus to attack and damage rolls made with it.\nWhen you roll a 20 on an attack roll with this weapon against an orc, that orc must succeed on a DC 17 Constitution saving throw or drop to 0 hit points.\nYou can’t be surprised by orcs while you’re not inca­pacitated. You are also aware when orcs are within 120 feet of you and aren’t behind total cover, although you don’t know their location.\nYou and any of your friends within 30 feet of you can’t be frightened while you’re not incapacitated.\n\nSentience. Orcsplitter is a sentient, lawful good weapon with an Intelligence of 6, a Wisdom of 15, and a Charisma of 10. It can see and hear out to 120 feet and has darkvision. It communicates by transmitting emotions to its wielder, although on rare occasions it uses a limited form of telepathy to bring to the wielder’s mind a couplet or stanza of ancient Dwarvish verse.\nPersonality. Orcsplitter is grim, taciturn, and inflexible. It knows little more than the desire to face orcs in battle and serve a courageous, just wielder. It disdains cowards and any form of duplicity, deception, or disloyalty. The weapon’s purpose is to defend dwarves and to serve as a symbol of dwarven resolve. It hates the traditional foes of dwarves \u0026#8212; giants, goblins, and, most of all, orcs \u0026#8212; and silently urges its possessor to meet such creatures in battle.\n\n\n\n\n","Source":"Princes of the Apocalypse","Type":"weapon","Rarity":"legendary","RequiresAttunment":true}