{"Id":690,"Name":"Spell Gem","PageContent":"\n\nSource: Out of the Abyss\nWondrous item, rarity varies (attunement optional)\nA spell gem can contain one spell from any class\u0027s spell list. You become aware of the spell when you learn the gems properties. While holding the gem. you can cast the spell from it as an action if you know the spell or if the spell is on your class spell list. Doing so doesn‘t require any components and doesn\u0027t require attunement. The spell then disappears from the gem.\nIf the spell is of a higher level than you can normally cast. you must make an ability check using your spellcasting ability to determine whether you cast it successfully. The DC equals 10 \u002B the spell\u0027s level. On a failed check. the spell disappears from the gem with no other effect.\nEach spell gem has a maximum level for the spell it can store. The spell level determines the gems rarity and the stored spell\u0027s saving throw DC and attack bonus. as shown in the Spell Gem table.\nYou can imbue the gem with a spell if you\u0027re attuned to it and it\u0027s empty. To do so, you cast the spell while holding the gem. The spell is stored in the gem instead of having any effect. Casting the spell must require either 1 action or 1 minute or longer, and the spell\u0027s level must be no higher than the gem\u0027s maximum. If the spell belongs to the school of abjuration and requires material components that are consumed. you must provide them. but they can be worth half as much as normal.\nOnce imbued with a spell. the gem can\u0027t be imbued again until the next dawn.\nDeep gnomes created these magic gemstones and keep the creation process a secret.\n\n\nSpell Gem\n\n\nMax. Spell Level\nGemstone\nRarity\nSave DC\nAttack Bonus\n\n\nCantrip\nObsidian\nUncommon\n13\n\u002B5\n\n\n1st\nLapis lazuli\nUncommon\n13\n\u002B5\n\n\n2nd\nQuartz\nRare\n13\n\u002B5\n\n\n3rd\nBloodstone\nRare\n15\n\u002B7\n\n\n4th\nAmber\nVery rare\n15\n\u002B9\n\n\n5th\nJade\nVery rare\n17\n\u002B9\n\n\n6th\nTopaz\nVery rare\n17\n\u002B10\n\n\n7th\nStar ruby\nLegendary\n18\n\u002B10\n\n\n8th\nRuby\nLegendary\n18\n\u002B10\n\n\n9th\nDiamond\nLegendary\n19\n\u002B11\n\n\n\n\n\n\n","Source":"Out of the Abyss","Type":"wondrous item","Rarity":"rarity varies","RequiresAttunment":false}