{"Id":694,"Name":"Stormgirdle","PageContent":"\n\nSource: Explorer\u0027s Guide to Wildemount\nWondrous item, legendary (requires attunement)\nA Stormgirdle is a wide belt made of thick leather branded with the symbol of Kord. The girdle\u0027s clasps are made from dragon ivory.\nDormant. While wearing the Stormgirdle in its dormant state, you have resistance to lightning damage and thunder damage, and your Strength score becomes 21 if it isn\u0027t already 21 or higher. In addition, you can use an action to become a Storm Avatar for 1 minute, gaining the following benefits for the duration:\n\nYou have immunity to lightning damage and thunder damage.\nWhen you hit with a weapon attack that normally deals bludgeoning damage, it deals thunder damage instead. When you hit with a weapon attack that normally deals piercing or slashing damage, it deals lightning damage instead.\nAs a bonus action, you can choose one creature you can see within 30 feet of you to be struck by lightning. The target must make a DC 15 Dexterity saving throw, taking 3d6 lightning damage on a failed save, or half as much damage on a successful one.\n\nOnce you use the girdle\u0027s Storm Avatar property, that property can\u0027t be used again until the next dawn.\nAwakened. While wearing the Stormgirdle in its awakened state, you gain the following benefits:\n\nYour Strength score becomes 23 if it isn\u0027t already 23 or higher.\nYour Storm Avatar\u0027s lightning strike deals 4d6 lightning damage (instead of 3d6).\nWhile transformed into a Storm Avatar, you gain a flying speed of 30 feet and can hover.\n\nExalted. While wearing the Stormgirdle in its exalted state, you gain the following benefits:\n\nYour Strength score becomes 25 if it isn\u0027t already 25 or higher.\nYour Storm Avatar\u0027s lightning strike deals 5d6 lightning damage (instead of 3d6).\nYou can cast the Control Weather spell from the girdle. This property can\u0027t be used again until the next dawn.\n\n\n\n\n\n","Source":"Explorer\u0027s Guide to Wildemount","Type":"wondrous item","Rarity":"legendary","RequiresAttunment":true}