{"Id":743,"Name":"Sword of Kas","PageContent":"\n\nSource: Dungeon Master\u0027s Guide\nWeapon (longsword), artifact (requires attunement)\nWhen Vecna grew in power, he appointed an evil and ruthless lieutenant, Kas the Bloody Handed, to act as his bodyguard and right hand. This despicable villain served as advisor, warlord, and assassin. His successes earned him Vecna\u0027s admiration and a reward: a sword with as dark a pedigree as the man who would wield it.\nFor a long time, Kas faithfully served the lich but as Kas\u0027s power grew, so did his hubris. His sword urged him to supplant Vecna, so that they could rule the lich\u0027s empire in Vecna\u0027s stead. Legend says Vecna\u0027s destruction came at Kas\u0027s hand, but Vecna also wrought his rebellious lieutenant\u0027s doom, leaving only Kas\u0027s sword behind. The world was made brighter thereby.\nThe Sword of Kas is a magic, sentient longsword that grants a \u002B3 bonus to attack and damage rolls made with it. It scores a critical hit on a roll of 19 or 20, and deals an extra 2d10 slashing damage to undead.\nIf the sword isn\u0027t bathed in blood within 1 minute of being drawn from its scabbard, its wielder must make a DC 15 Charisma saving throw. On a successful save, the wielder take 3d6 psychic damage. On a failed save, the wielder is dominated by the sword, as if by the Dominate Monster spell, and the sword demands that it be bathed in blood. The spell effect ends when the sword\u0027s demand is met.\nRandom Properties. The Sword of Kas has the following random properties:\n\n1 minor beneficial property\n1 major beneficial property\n1 minor detrimental property\n1 major detrimental property\n\nSpirit of Kas. While the sword is on your person, you add a d10 to your initiative at the start of every combat. In addition, when you use an action to attack with the sword, you can transfer some or all of its attack bonus to your Armor Class instead. The adjusted bonuses remain effect until the start of your next turn.\nSpells. While the sword is on your person, you can use an action to cast one of the following spells (save DC 18) from it: Call Lightning, Divine Word, or Finger of Death. Once you use the sword to cast a spell, you can\u0027t cast that spell again from it until the next dawn.\nSentience. The Sword of Kas is a sentient chaotic evil weapon with an Intelligence of 15, a Wisdom of 13, and a Charisma of 16. It has hearing and darkvision out to 2 range of 120 feet.\nThe weapon communicates telepathically with its wielder and can speak, read, and understand Common\nPersonality. The sword\u0027s purpose is to bring ruin to Vecna. Killing Vecna\u0027s worshipers, destroying the lich\u0027s works, and foiling his machinations all help to fulfill this goal.\nThe Sword of Kas also seeks to destroy anyone corrupted by the Eye and Hand of Vecna. The sword\u0027s obsession with those artifacts eventually becomes a fixation for its wielder.\nDestroying the Sword. A creature attuned to both the Eye of Vecna and the Hand of Vecna can use the Wish property of those combined artifacts to unmake the Sword of Kas. The creature must cast the Wish spell and make a Charisma check contested by the Charisma check of the sword. The sword must be within 30 feet of the creature, or the spell fails. If the sword wins the contest, nothing happens, and the Wish spell is wasted. If the sword loses the contest, it is destroyed.\n\n\n\n\n","Source":"Dungeon Master\u0027s Guide","Type":"weapon","Rarity":"artifact","RequiresAttunment":true}