{"Id":745,"Name":"Teeth of Dahlver-Nar","PageContent":"\n\nSource: Tasha\u0027s Cauldron of Everything\nWondrous item, artifact (requires attunement)\nThe Teeth of Dahlver-Nar are stories given form. They are a collection of teeth, each suggestive of wildly different origins and made from various materials. The collection rests within a leather pouch, stitched with images of heroes and whimsical creatures. Where the teeth fall, they bring legends to life.\nUsing the Teeth. While you are holding the pouch, you can use an action to draw one tooth. Roll on the Teeth of Dahlver-Nar table to determine which tooth you draw, and you can either sow the tooth or implant it (both of which are described later).\nIf you don\u0027t sow or implant the tooth, roll a die at the end of your turn. On an even number, the tooth vanishes, and creatures appear as if you sowed the tooth, but they are hostile to you and your allies. On an odd number, the tooth replaces one of your teeth as if you implanted it (potentially replacing another implanted tooth, see below).\nEach tooth can only be used once. Track which teeth have been used. If a tooth\u0027s result is rolled after it\u0027s been used, you draw the next lowest unused tooth on the table.\nSowing Teeth. To sow the tooth, you place it on the ground in an unoccupied space within your reach, or you throw it into an unoccupied space within 10 feet of you in a body of water that is at least 50 feet wide and 50 feet long. Upon doing so, the tooth burrows into the ground and vanishes, leaving no hole behind, or it vanishes into the water. The creatures noted in the Creatures Summoned column appear in an unoccupied space as close to where the tooth was sown as possible. The creatures are allies to you, speak all languages you speak, and linger for 10 minutes before disappearing, unless otherwise noted.\nImplanting Teeth. To implant the tooth, you place it in your mouth, whereupon one of your own teeth falls out, and the drawn tooth takes its place, resizing to fit in your mouth. Once the tooth is implanted, you gain the effect noted in the Implanted Effect column. The tooth can\u0027t be removed while you are attuned to the teeth, and you can\u0027t voluntarily end your attunement to them. If removed after your death, the tooth vanishes. You can have a maximum number of the teeth implanted at one time equal to 1 \u002B your Constitution modifier (minimum of 2 teeth total). If you try to implant more teeth, the newly implanted tooth replaces one of the previous teeth, determined randomly. The replaced tooth vanishes, and you lose the implanted effect.\nRecovering Teeth. Once all the teeth have vanished, their pouch also vanishes. The pouch with all the teeth then appears in a random destination, which could be on a different world of the Material Plane.\nDestroying the Teeth. Each tooth must be destroyed individually by sowing it in the area where the tooth\u0027s story originated, with the intention to destroy it. When planted in this way, creatures summoned are not friendly to you and do not vanish. Some of the creatures summoned merely head off in search of home, while others act as their tales dictate. In either case, the tooth is gone forever.\n\n\nTeeth of Dahlver-Nar\n\n\n1d20\nTale and Tooth\nCreatures Summoned\nImplanted Effect\n\n\n1\nThe Staring Cats of Uldun-dar (ivory cat molar)\n9 cats\nThe tooth has 8 charges. As an action, you can expend 1 charge to cast the Revivify spell from the tooth. If you are dead at the start of your turn, the tooth expends 1 charge and casts Revivify on you.\n\n\n2\nDuggle\u0027s Surprising Day (human molar)\n1 commoner\nWhen you finish a long rest, the tooth casts Sanctuary (DC 18) on you, and the spell lasts for 24 hours or until you break it.\n\n\n3\nThe Golden Age of Dhakaan (golden goblin bicuspid)\n10 goblins, 1 goblin boss\nWhen you are hit by an attack and an ally is within 5 feet of you, you can use your reaction to cause them to be hit instead. You can\u0027t use this reaction again until you finish a short or long rest.\n\n\n4\nThe Mill Road Murders (halfling canine)\n3 green hags in a coven\nWhen you damage a target that hasn\u0027t taken a turn in this combat, the target takes an extra 3d10 slashing damage from ghostly blades.\n\n\n5\nDooms of the Malpheggi (emerald lizardfolk fang)\n1 lizardfolk queen and 4 lizardfolk\nYou gain reptilian scales, granting you a \u002B2 bonus to your AC. Additionally, when you finish a long rest, you must succeed on a DC 15 Constitution saving throw or gain l level of exhaustion.\n\n\n6\nThe Stable Hand\u0027s Secret (sweet-tasting human canine)\n2 incubi\nWhen you make a Charisma check against a humanoid, you can roll a d10 and add the number rolled as a bonus to the result. The creature then becomes hostile to you at the next dawn.\n\n\n7\nThe Donkey\u0027s Dream (rainbow-colored donkey molar)\n1 unicorn\nThe tooth has 3 charges. As an action, you can expend 1 charge to touch a creature. The target regains 2d8 \u002B 2 hit points, and all diseases and poisons affecting it are removed. When you use this action, a shimmering image of a unicorn\u0027s horn appears until the end of your turn, sprouting from your forehead. The tooth regains all expended charges daily at dawn. You gain the following flaw: \u0026quot;When I see wickedness in action, I must oppose it.\u0026quot;\n\n\n8\nBeyond the Rock of Bral (silver mind-flayer tooth)\n2 mind flayers\nYou gain telepathy out to 120 feet as described in the Monster Manual, and you can cast the Detect Thoughts spell at will, requiring no components. You also have disadvantage on Wisdom (Insight) and Wisdom (Perception) checks from constant whispers of memories and nearby minds.\n\n\n9\nThe Disappearances of Half Hollow (vomerine tooth of a Large toad)\n4 giant toads\nYour long jump is up to 30 feet and your high jump is up to 15 feet, with or without a running start.\n\n\n10\nLegendary of Phantoms and Ghosts (obsidian human molar)\n1 giant octopus, 1 mage, 1 specter\nAs an action, you can use the tooth to cast the Evard\u0027s Black Tentacles spell (DC 18). Once this property is used, it can\u0027t be used again until the next dawn.\n\n\n11\nThe Thousand Deaths of Jander Sunstar (yellowed vampire fang)\n1 vampire\nYou can make a bite attack as an unarmed strike. On a hit, it deals 1d6 piercing damage plus 3d6 necrotic damage. You regain a number of hit points equal to the necrotic damage dealt. While you are in sunlight, you can\u0027t regain hit points.\n\n\n12\nNightmares of Kaggash (twisted beholder tooth)\n1 beholder\nAs an action, you can cast the Eyebite spell from the tooth. Once you use this action, it can\u0027t be used again until the next dawn. Whenever you finish a long rest, roll a d20. On a 20, an aberration chosen by the DM appears within 30 feet of you and attacks.\n\n\n13\nThree Bridges to the Sky (lapis lazuli oni fang)\n3 oni\nYou gain a flying speed of 30 feet, and you can use the tooth to cast the Detect Magic spell at will. While you are attuned to fewer than 3 magic items, you gain l level of exhaustion that can\u0027t be removed until you are attuned to three or more magic items.\n\n\n14\nThe Claws of Dragotha (broken translucent fang)\n1 adult red dracolich\nYou can use the tooth to cast the Create Undead spell. Once this property is used, it can\u0027t be used again until the next dawn. Each time you create an undead creature using the tooth, a skeleton, zombie, or ghoul also appears at a random location within 5 miles of you, searching for the living to kill. A humanoid killed by these undead rises as the same type of undead at the next midnight.\n\n\n15\nAshes of the Ages and Eternal Fire (jade humanoid bicuspid)\n1 dao, 1 djinni, 1 efreeti, 1 marid\nYou can use the tooth to cast Counterspell at 9th level. Once you use this property, it can\u0027t be used again until the next dawn. Whenever you finish a long rest, if you haven\u0027t used the tooth to counter a spell since your last long rest, your hit point maximum is reduced by 2d10. If this reduces your hit point maximum to 0, you die.\n\n\n16\nDaughters of Bel (green steel pit fiend fang)\n1 pit fiend\nYou can use the tooth to cast Dominate Monster (DC 18). Once you use this property, it can\u0027t be used again until the next dawn. You smell strongly of burning sulfur.\n\n\n17\nWhy the Sky Screams (blue dragon fang)\n1 ancient blue dragon\nYou gain immunity to lightning damage and vulnerability to thunder damage.\n\n\n18\nThe Last Tarrasque (jagged sliver of tarasque tooth)\n1 tarrasque (ignores you and your commands; appears for 1d4 rounds then vanishes)\nYou deal double damage to objects and structures. If you take 20 or more damage in one turn, you must succeed on a DC 18 Wisdom saving throw or spend your next turn in a murderous fury. During this rage, you must use your action to make an unarmed strike against a creature that damaged you, or a random creature you can see if you weren\u0027t damaged by a creature, moving as close as you can to the target if necessary.\n\n\n19\nIncendax\u0027s Tooth (ruby-veined red dragon fang)\n1 ancient red dragon\nYou gain immunity to fire damage, and as an action, you can exhale fire in a 90-foot cone. Each creature in that area must make a DC 24 Dexterity saving throw, taking 26d6 fire damage on a failed save, or half as much damage on a successful one. After using the breath weapon, you gain 2 levels of exhaustion.\n\n\n20\nDahlver-Nar\u0027s Tooth (dusty human molar)\n1 priest\nAs an action you can call on a divine force to come to your aid. Describe the assistance you seek, and the DM decides the nature of the intervention; the effect of any cleric spell would be appropriate. Once this property is used, it can\u0027t be used again for 7 days.\n\n\n\n\n\n\n","Source":"Tasha\u0027s Cauldron of Everything","Type":"wondrous item","Rarity":"artifact","RequiresAttunment":true}