{"Id":394,"Name":"Summon Draconic Spirit","School":"conjuration","Level":5,"PageContent":"Source: Fizban\u0027s Treasury of Dragons\n5th-level Conjuration\nCasting Time: 1 Action\nRange: 60ft\nComponents: V, S, M (an object with the image of a dragon engraved on it, worth at least 500 gp)\nDuration: Concentration, up to 1 hour\nYou call forth a draconic spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Draconic Spirit stat block. When you cast this spell, choose a family of dragon: chromatic, gem, or metallic. The creature resembles a dragon of the chosen family, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.\nThe creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.\nAt Higher Levels. When you cast this spell using a spell slot of 6th level or higher, use the higher level wherever the spell’s level appears in the stat block.\nDraconic Spirit\nLarge Dragon, Neutral\nArmor Class 14 \u002B the level of the spell (natural armor)\nHit Points 50 \u002B 10 for each spell level above 5th (the dragon has a number of hit dice [d10s] equal to the level of the spell)\nSpeed 30 ft., fly 60 ft., swim 30 ft.\nSTR\nDEX\nCON\nINT\nWIS\nCHA\n19 (\u002B4)\n14 (\u002B2)\n17 (\u002B3)\n10 (\u002B0)\n14 (\u002B2)\n14 (\u002B2)\nDamage Resistances(Chromatic and Metallic Only) acid, cold, fire, lightning, poison\nDamage Resistances(Gem Only) force, necrotic, psychic, radiant, thunder\nCondition Immunities charmed, frightened, poisoned\nSenses blindsight 30 ft., darkvision 60 ft., passive Perception 12\nLanguages Draconic, understands the languages you speak\nChallenge — Proficiency Bonus (PB) equals your bonus\nShared Resistances. When you summon the dragon, choose one of its damage resistances. You have resistance to the chosen damage type until the spell ends\nActions\nMultiattack. The dragon makes a number of Rend attacks equal to half the spell’s level (rounded down), and it uses Breath Weapon.\nRend. Melee Weapon Attack: your spell attack modifier to hit, reach 10 ft., one target. Hit: 1d6 plus 4 \u002B the spell\u0027s level piercing damage.\nBreath Weapon. The dragon exhales destructive energy in a 30-foot cone. Each creature in that area must make a Dexterity saving throw against your spell save DC. A creature takes 2d6 damage of a type this dragon has resistance to (your choice) on a failed save, or half as much damage on a successful one.\nSpell Lists. Druid, Sorcerer, Wizard","InLists":["Druid","Sorcerer","Wizard"],"Source":"Fizban\u0027s Treasury of Dragons","CastingTime":"1 action","Components":["V","S","M (an object with the image of a dragon engraved on it","worth at least 500 gp)"],"Range":"60ft","Duration":"concentration, up to 1 hour","WikidotLink":"http://dnd5e.wikidot.com//spell:summon-draconic-spirit"}