{"Id":329,"Name":"Spirit Of Death","School":"necromancy","Level":4,"PageContent":"Source: The Book of Many Things\n4th-level necromancy\nCasting Time: 1 action\nRange: 60 feet\nComponents: V, S, M (a gilded playing card worth at least 400 gp and depicting an avatar of death)\nDuration: Concentration, up to 1 hour\nYou call forth a spirit that embodies death. The spirit manifests in an unoccupied space you can see within range and uses the reaper spirit stat block. The spirit disappears when it is reduced to 0 hit points or when the spell ends.\nThe spirit is an ally to you and your companions. In combat, the spirit shares your initiative count and takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue the spirit any commands, it takes the Dodge action and uses its movement to avoid danger.\nAt Higher Levels. When you cast this spell using a spell slot of 5th level or higher, use the higher level wherever the spell’s level appears in the reaper spirit stat block.\nSpell Lists. Sorcerer, Warlock, Wizard\nReaper Spirit\nMedium Undead, Neutral\nArmor Class: 11 \u002B the level of the spell (natural armor)\nHit Points: 40 \u002B 10 for each level of the spell above 4th\nSpeed: 30 ft., fly 30 ft. (hover)\nSTR\nDEX\nCON\nINT\nWIS\nCHA\n16 (\u002B3)\n16 (\u002B3)\n16 (\u002B3)\n16 (\u002B3)\n16 (\u002B3)\n16 (\u002B3)\nDamage Immunities: necrotic, poison\nCondition Immunities: charmed, exhaustion, frightened, paralyzed, poisoned\nSenses: darkvision 60 ft., passive Perception 13\nLanguages: understands the languages you speak\nChallenge: \u0026#8212;\nProficiency Bonus: equals your bonus\nIncorporeal Movement. The reaper can move through other creatures and objects as if they were difficult terrain. If it ends its turn inside an object, it is shunted to the nearest unoccupied space and takes 1d10 force damage for every 5 feet traveled.\nActions\nMultiattack. The spirit makes a number of Reaping Scythe attacks equal to half the level of the spell (rounded down).\nReaping Scythe. Melee Weapon Attack: your spell attack modifier to hit (with advantage), reach 5 ft., one target. Hit: 1d8 \u002B 3 \u002B the spell’s level necrotic damage.\nBonus Actions\nHaunt Creature The spirit targets a creature it can see within 10 feet of itself and begins haunting it. While the target is haunted, you and the spirit sense the direction and distance to the target if it is on the same plane of existence as you. Additionally, if the target starts its turn within 10 feet of the spirit, the target must succeed on a Wisdom saving throw against your spell save DC or have the frightened condition until the start of the target’s next turn. The target remains haunted until it dies, the spirit disappears, or the spirit uses this action again.","InLists":["Sorcerer","Warlock","Wizard"],"Source":"The Book of Many Things","CastingTime":"1 action","Components":["V","S","M (a gilded playing card worth at least 400 gp and depicting an avatar of death)"],"Range":"60 feet","Duration":"concentration, up to 1 hour","WikidotLink":"http://dnd5e.wikidot.com//spell:spirit-of-death"}