{"Id":389,"Name":"Summon Celestial","School":"conjuration","Level":5,"PageContent":"Source: Tasha\u0027s Cauldron of Everything\n5th-level conjuration\nCasting Time: 1 action\nRange: 90 feet\nComponents: V, S, M (a golden reliquary worth at least 500 gp)\nDuration: Concentration, up to 1 hour\nYou call forth a celestial spirit. It manifests in an angelic form in an unoccupied space that you can see within range. This corporeal form uses the Celestial Spirit stat block. When you cast the spell, choose Avenger or Defender. Your choice determines the creature’s attack in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.\nThe creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.\nAt Higher Levels. When you cast this spell using a spell slot of 6th level or higher, use the higher level whenever the spell’s level appears in the stat block.\nSpell Lists. Cleric, Paladin\n\n\nCelestial Spirit\n\n\nLarge celestial\n\n\nArmor Class: 11 \u002B the level of the spell (natural armor) \u002B 2 (Defender only)\n\n\nHit Points: 40 \u002B 10 for each spell level above 5th\n\n\nSpeed: 30 ft., fly 40 ft.\n\n\nSTR\nDEX\nCON\nINT\nWIS\nCHA\n\n\n16 (\u002B3)\n14 (\u002B2)\n16 (\u002B3)\n10 (\u002B0)\n14 (\u002B2)\n16 (\u002B3)\n\n\nDamage Resistances: radiant\n\n\nCondition Immunities: charmed, frightened\n\n\nSenses: darkvision 60 ft., passive Perception 10\n\n\nLanguages: Celestial, understands the languages you speak\n\n\nChallenge: \u0026#8212;\n\n\nProficiency Bonus: equals your bonus\n\n\nActions\n\n\nMultiattack. The celestial makes a number of attacks equal to half this spell’s level (rounded down).\n\n\nRadiant Bow (Avenger Only). Ranged Weapon Attack: your spell attack modifier to hit, reach 150/600 ft., one target. Hit: 2d6 \u002B 2 \u002B the spell’s level radiant damage.\n\n\nRadiant Mace (Defender Only). Melee Weapon Attack: your spell attack modifier to hit, reach 5 ft., one target. Hit: 1d10 \u002B 3 \u002B the spell’s level radiant damage, and the celestial can choose itself or another creature it can see within 10 feet of the target. The chosen creature gains 1d10 temporary hit points.\n\n\nHealing Touch (1/Day). The celestial touches another creature. The target magically regains hit points equal to 2d8 \u002B the spell’s level.","InLists":["Cleric","Paladin"],"Source":"Tasha\u0027s Cauldron of Everything","CastingTime":"1 action","Components":["V","S","M (a golden reliquary worth at least 500 gp)"],"Range":"90 feet","Duration":"concentration, up to 1 hour"}