{"Name":"Teleport","School":"conjuration","Level":7,"PageContent":"Source: Player\u0027s Handbook\n7th-level conjuration\nCasting Time: 1 action\nRange: 10 feet\nComponents: V\nDuration: Instantaneous\nThis spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can’t be held or carried by an unwilling creature.\nThe destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The DM rolls d100 and consults the table.\n\n\nFamiliarity\nMishap\nSimilar Area\nOff Target\nOn Target\n\n\nPermanent circle\n—\n—\n—\n01-100\n\n\nAssociated object\n—\n—\n—\n01-100\n\n\nVery familiar\n01-05\n06-13\n14-24\n25-100\n\n\nSeen casually\n01-33\n34-43\n44-53\n54-100\n\n\nViewed once\n01-43\n44-53\n54-73\n74-100\n\n\nDescription\n01-43\n44-53\n54-73\n74-100\n\n\nFalse destination\n01-50\n51-100\n—\n—\n\n\n\u0026quot;Permanent circle\u0026quot; means a permanent Teleportation Circle whose sigil sequence you know.\n\u0026quot;Associated object\u0026quot; means that you possess an object taken from the desired destination within the last six months, such as a book from a wizard\u0027s library, bed linen from a royal suite, or a chunk of marble from a lich\u0027s secret tomb.\n\u0026quot;Very familiar\u0026quot; is a place you have been very often, a place you have carefully studied, or a place you can see when you cast the spell.\n\u0026quot;Seen casually\u0026quot; is someplace you have seen more than once but with which you aren\u0027t very familiar.\n\u0026quot;Viewed once\u0026quot; is a place you have seen once, possibly using magic.\n\u0026quot;Description\u0026quot; is a place whose location and appearance you know through someone else\u0027s description, perhaps from a map.\n\u0026quot;False destination\u0026quot; is a place that doesn\u0027t exist. Perhaps you tried to scry an enemy\u0027s sanctum but instead viewed an illusion, or you are attempting to teleport to a familiar location that no longer exists.\n\nOn Target. You and your group (or the target object) appear where you want to.\n\n\nOff Target. You and your group (or the target object) appear a random distance away from the destination in a random direction. Distance off target is 1d10 x 1d10 percent of the distance that was to be traveled. For example, if you tried to travel 120 miles, landed off target, and rolled a 5 and 3 on the two d10s, then you would be off target by 15 percent, or 18 miles. The DM determines the direction off target randomly by rolling a d8 and designating 1 as north, 2 as northeast, 3 as east, and so on around the points of the compass. If you were teleporting to a coastal city and wound up 18 miles out at sea, you could be in trouble.\n\n\nSimilar Area. You and your group (or the target object) wind up in a different area that\u0027s visually or thematically similar to the target area. If you are heading for your home laboratory, for example, you might wind up in another wizard\u0027s laboratory or in an alchemical supply shop that has many of the same tools and implements as your laboratory. Generally, you appear in the closest similar place, but since the spell has no range limit, you could conceivably wind up anywhere on the plane.\n\n\nMishap. The spell\u0027s unpredictable magic results in a difficult journey. Each teleporting creature (or the target object) takes 3d10 force damage, and the DM rerolls on the table to see where you wind up (multiple mishaps can occur, dealing damage each time).\n\nSpell Lists. Bard, Sorcerer, Wizard","InLists":["Bard","Sorcerer","Wizard"],"Source":"Player\u0027s Handbook","CastingTime":"1 action","Components":["V"],"Range":"10 feet","Duration":"instantaneous"}